In [1]:
import pandas as pd
import psycopg2 as pg
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://postgres:1234@localhost/LIA_BD')

In [3]:
conn = pg.connect(user = 'postgres',
                  password = '1234',
                  host = 'localhost',
                  port = '5432',
                  database = 'LIA_BD')

In [4]:
print(conn.info)
print(conn.status)

<psycopg2.extensions.ConnectionInfo object at 0x0000022D5BB40790>
1

In [5]:
cursor = conn.cursor()

In [9]:
cursor.execute("ROLLBACK")

# Criando Clientes
cliente_nome = input("Digite o nome do Cliente:")
cliente_end = input("Digite o endereço do cliente:")
cursor.execute("insert into cliente (cli_nome, cli_endereço) values ('{name}','{end}')".format(name=cliente_nome, end=cliente_end))
conn.commit()

query = "SELECT * FROM cliente"
df_cliente = pd.read_sql_query(query, con=engine)
df_cliente

Digite o nome do Cliente:Fulano
Digite o endereço do cliente:Rua 10, 220

   cli_id cli_nome                                       cli_endereço
0       1  Gustavo  Vila Santa Maria de Nazareth, Rua Elias Gomes,...
1       2   Fulano                                        Rua 10, 220

In [11]:
# Criando Livros
titulo = input("Digite o titulo do livro:")
isbn = input("Digite o isbn:")
cursor.execute("insert into livro (liv_titulo, liv_isbn) values ('{tit}','{isbn}')".format(tit=titulo, isbn=isbn))
conn.commit()

query = "SELECT * FROM livro"
df_livro = pd.read_sql_query(query, con=engine)
df_livro

Digite o titulo do livro:Pequeno Principe
Digite o isbn:bca234

   liv_id        liv_titulo liv_isbn
0       1     Stewart Vol 1   abc123
1       2  Pequeno Principe   bca234

In [19]:
# Criando Venda

cursor.execute("ROLLBACK")

valor = input("Digite o valor da venda:")
frete = input("Digite o frete da venda:")
id_cliente = input("Digite o id do cliente:")
id_liv = input('Digite o id do livro:')
cursor.execute("insert into venda (ven_valor, ven_frete, cli_id, liv_id) values ({valor},{frete},{cliente},{livro})".format(valor=valor, frete=frete, cliente=id_cliente, livro=id_liv))
conn.commit()

query = "SELECT * FROM venda"
df_venda = pd.read_sql_query(query, con=engine)
df_venda

Digite o valor da venda:70
Digite o frete da venda:20
Digite o id do cliente:1
Digite o id do livro:1

   ven_id  ven_frete  ven_valor  cli_id  liv_id
0       1         15         80       1       1
1       2         20        150       1       2
2       3         40         80       2       1
3       4         14        200       2       2
4       5         20         70       1       1